/* 
1) Написать свою реализацию встроенной функции массивов filter. 
Назвать функцию myFilter и сделать так, чтобы любой массив мог использовать данную функцию как "родную". 
В качестве параметров он должен принимать callback-функцию и как необязательный параметр объект, 
который будет использован в качестве this в рамках внутренних вызовов данной callback-функции.

В конечном итоге ваша реализация myFilter должна работать точно также как и встроенный метод filter. 
Callback-функция, переданная в качестве параметра, также должна вызываться с теми же параметрами, 
что и оригинал (элемент, индекс, массив).
*/

Array.prototype.myFilter = function (callback, thisArg = this) {
  console.log(thisArg);
};

[1, 2].myFilter();
