/* 
Кому будет скучно/недостаточно, можете сделать ещё один класс LinkedList. 
Конструктор этого класса не должен принимать никаких параметров.
Реализовать публичные методы:
- append(elem) - добавить элемент в конец связного списка;
- prepend(elem) - добавить элемент в начало связного списка;
- find(elem) - осуществить поиск по элементам по заданному 
    значению. Вернуть найденный элемент или null, если такого элемента нет;

- toArray() - возвращает новый массив, состоящий из элементов связного списка.

Реализовать статические публичные методы:
- fromIterable(iterable) - возвращает новый LinkedList, элементами 
которого служат элементы переданной итерируемой сущности. 
Если сущность не является итерируемой генерировать ошибку.
*/

class LinkedList {}
